{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8129b14e",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Data Engineering Project \n",
    "## ETL\n",
    "\n",
    "**Authors**: \n",
    "- Dmitri Rozgonjuk\n",
    "- Eerik Sven Puudist\n",
    "- Lisanne Siniväli\n",
    "- Cheng-Han Chung\n",
    "\n",
    "\n",
    "The aim of this script is to clean the main raw data frame and write a new, clean data frame for further use. In this notebook, the comparisons of different read- and write-methods are demonstrated."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fee549b9",
   "metadata": {},
   "source": [
    "First, we install and import the necessary libraries from one cell (to avoid having libraries in some individual cells below). The packages and their versions to be installed will later be added to the `requirements.txt` file.\n",
    "\n",
    "We also use this section to set global environment parameters."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "454d0310",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install -r requirements.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "97dce2ac",
   "metadata": {},
   "outputs": [],
   "source": [
    "################### Imports ####################\n",
    "### Data wrangling\n",
    "import pandas as pd # working with dataframes\n",
    "\n",
    "### Database drivers\n",
    "import psycopg2\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Custom scripts \n",
    "## Neo4J\n",
    "import sys\n",
    "sys.path.append('./dags')\n",
    "from scripts.raw_to_tables import *\n",
    "from scripts.augmentations import *\n",
    "from scripts.final_tables import *\n",
    "from scripts.sql_queries import *\n",
    "from scripts.neo4j_queries import *\n",
    "\n",
    "# MISC\n",
    "import warnings\n",
    "from tqdm import tqdm\n",
    "\n",
    "########## SETTING ENV PARAMETERS ################\n",
    "warnings.filterwarnings('ignore') # suppress warnings"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "03a98719",
   "metadata": {},
   "source": [
    "# 5. Example Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8efb114e",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 5.1. Data Warehouse"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "12847d4b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def pandas_to_dwh():\n",
    "    \"\"\"Task that imports .csv-s to pandas, makes the Postgres-connection,\n",
    "    creates a database, drops existing and creates new tables, and inserts\n",
    "    the data from pandas.\n",
    "    \"\"\"\n",
    "    # Import the data\n",
    "    try:\n",
    "        article = pd.read_csv('dags/data_ready/article.csv', error_bad_lines=False)\n",
    "        author = pd.read_csv('dags/data_ready/author.csv', error_bad_lines=False)\n",
    "        authorship = pd.read_csv('dags/data_ready/authorship.csv', error_bad_lines=False)\n",
    "        category = pd.read_csv('dags/data_ready/category.csv', error_bad_lines=False)\n",
    "        article_category = pd.read_csv('dags/data_ready/article_category.csv', error_bad_lines=False)\n",
    "        journal = pd.read_csv('dags/data_ready/journal.csv', error_bad_lines=False)\n",
    "        tables = [article, author, authorship, category, article_category, journal]\n",
    "\n",
    "        # Name of tables (for later print)\n",
    "        article.name = 'article'\n",
    "        author.name = 'author'\n",
    "        authorship.name = 'authorship'\n",
    "        category.name = 'category'\n",
    "        article_category.name = 'article_category'\n",
    "        journal.name = 'journal'\n",
    "        print(article.head(2))\n",
    "        print(author.head(2))\n",
    "        print(authorship.head(2))\n",
    "        print(category.head(2))\n",
    "        print(article_category.head(2))\n",
    "        print(journal.head(2))\n",
    "        print('All tables staged for DWH.')\n",
    "    except:\n",
    "        print('Error with importing the data tables')\n",
    "        sys.exit(1)\n",
    "       \n",
    "    # Connect to the database\n",
    "    try: \n",
    "        print('Connecting to Postgres...')\n",
    "        conn = psycopg2.connect(host=\"postgres\", user=\"airflow\", password=\"airflow\", database =\"airflow\", port = 5432)\n",
    "        conn.set_session(autocommit=True)\n",
    "        cur = conn.cursor()\n",
    "    except:\n",
    "        print('Postgres connection not established')\n",
    "        sys.exit(1)\n",
    "\n",
    "    try:\n",
    "        # Insert into tables\n",
    "        for i in tqdm(range(len(tables))):\n",
    "            insert_to_tables(cur, tables[i], insert_tables[i])\n",
    "    except:\n",
    "        print('Error in inserting the data.')\n",
    "        print('Error in inserting the data.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e02c4ea5",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = psycopg2.connect(host=\"postgres\", user=\"airflow\", password=\"airflow\", database =\"airflow\", port = 5432)\n",
    "conn.set_session(autocommit=True)\n",
    "cur = conn.cursor()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "bbc58504",
   "metadata": {},
   "outputs": [],
   "source": [
    "article = pd.read_csv('dags/data_ready/article.csv', error_bad_lines=False)\n",
    "author = pd.read_csv('dags/data_ready/author.csv', error_bad_lines=False)\n",
    "authorship = pd.read_csv('dags/data_ready/authorship.csv', error_bad_lines=False)\n",
    "category = pd.read_csv('dags/data_ready/category.csv', error_bad_lines=False)\n",
    "article_category = pd.read_csv('dags/data_ready/article_category.csv', error_bad_lines=False)\n",
    "journal = pd.read_csv('dags/data_ready/journal.csv', error_bad_lines=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "82bd0434",
   "metadata": {},
   "outputs": [],
   "source": [
    "article = article[~article['article_id'].isnull()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a615a9d5",
   "metadata": {},
   "outputs": [],
   "source": [
    "authorship = authorship[authorship['article_id'].isin(article['article_id'])].reset_index(drop = True)\n",
    "author = author[author['author_id'].isin(authorship['author_id'])].reset_index(drop = True)\n",
    "journal = journal[journal['journal_issn'].isin(article['journal_issn'])].reset_index(drop = True)\n",
    "article_category = article_category[article_category['article_id'].isin(article['article_id'])].reset_index(drop = True)\n",
    "category = category[category['category_id'].isin(article_category['category_id'])].reset_index(drop = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "558e390b",
   "metadata": {},
   "outputs": [],
   "source": [
    "article.to_csv('dags/data_ready/article.csv', index = False)\n",
    "author.to_csv('dags/data_ready/author.csv', index = False)\n",
    "journal.to_csv('dags/data_ready/journal.csv', index = False)\n",
    "article_category.to_csv('dags/data_ready/article_category.csv', index = False)\n",
    "category.to_csv('dags/data_ready/category.csv', index = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61edf0ba",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cad5c0f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "tables = [article, author, authorship, category, article_category, journal]\n",
    "\n",
    "        # Name of tables (for later print)\n",
    "article.name = 'article'\n",
    "author.name = 'author'\n",
    "authorship.name = 'authorship'\n",
    "category.name = 'category'\n",
    "article_category.name = 'article_category'\n",
    "journal.name = 'journal'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "86fa747b",
   "metadata": {},
   "outputs": [],
   "source": [
    " # Drop Tables \n",
    "for query in drop_tables:\n",
    "    cur.execute(query)\n",
    "    conn.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "16ceb28a",
   "metadata": {},
   "outputs": [],
   "source": [
    "for query in create_tables:\n",
    "    cur.execute(query)\n",
    "    conn.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "111c693b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def insert_to_tables(cur, table, query):\n",
    "    ''' Helper function for inserting values to Postresql tables\n",
    "    Args:\n",
    "        table (pd.DataFrame): pandas table\n",
    "        query (SQL query): correspondive SQL query for 'table' for data insertion in DB\n",
    "    '''\n",
    "    print(f'Inserting table -- {table.name} -- ...')\n",
    "    \n",
    "    try:\n",
    "        for i, row in table.iterrows():\n",
    "            cur.execute(query, list(row))\n",
    "        print(f'Table -- {table.name} -- successfully inserted!')\n",
    "    except:\n",
    "        print(f'Error with table -- {table.name} --')\n",
    "    print()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1f86d27d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from scripts.sql_queries import *\n",
    "for i in tqdm(range(len(tables))):\n",
    "    insert_to_tables(cur, tables[i], insert_tables[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "6a5c61b2",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "%load_ext sql\n",
    "%sql postgresql://airflow:airflow@postgres/airflow"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "ffd8817e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>15240</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[(15240,)]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql SELECT COUNT(*) FROM article;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "56d51e32",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "%sql SELECT COUNT(*) FROM author;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "370a4298",
   "metadata": {},
   "outputs": [],
   "source": [
    "%sql SELECT * FROM author LIMIT 3;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "29744cda",
   "metadata": {},
   "outputs": [],
   "source": [
    "%sql SELECT * FROM article LIMIT 3;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2ebaebf5",
   "metadata": {},
   "outputs": [],
   "source": [
    "%sql SELECT * FROM article_category LIMIT 3;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "00a1af40",
   "metadata": {},
   "outputs": [],
   "source": [
    "%sql SELECT * FROM category LIMIT 3;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a75395b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "%sql SELECT * FROM journal LIMIT 3;"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d9f1e466",
   "metadata": {},
   "source": [
    "### Who are the top 0.01% scientists with the most publications in the sample?\n",
    "Outcome: list of 0.01% top scientists, count of publications, ranking in terms of the total sample."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "4a766928",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "3 rows affected.\n",
      "Returning data to local variable query_one\n"
     ]
    }
   ],
   "source": [
    "%%sql query_one <<\n",
    "SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "FROM author \n",
    "ORDER BY rank_total_pubs \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "44a41b6c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>publications</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>154</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 163), ('WangX', 2, 158), ('ZhangJ', 3, 154)]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_one"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6e982c9b",
   "metadata": {},
   "source": [
    "### Proportionally, in which journals have the top 0.01% of scientists (in terms of publication count) published their work the most?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "03106966",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "3 rows affected.\n",
      "Returning data to local variable query_two\n"
     ]
    }
   ],
   "source": [
    "%%sql query_two <<\n",
    "SELECT final.author_id, final.rank, final.publications, final.journal_title as top_journal,  TO_CHAR((final.number * 100 / final.publications), 'fm99%') as percentage_of_all_publications\n",
    "FROM (select a.author_id, rank, publications, mode() within group (order by j.journal_title) AS journal_title, COUNT(j.journal_title) as number\n",
    "      from (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "      FROM author \n",
    "      ORDER BY rank_total_pubs \n",
    "      LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "      INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "      INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "      INNER JOIN journal j ON ar.journal_issn = j.journal_issn\n",
    "      group by a.author_id, rank, publications,j.journal_title\n",
    "      having j.journal_title = mode() within group (order by j.journal_title)) as final\n",
    "LEFT JOIN (select a.author_id, rank, publications, mode() within group (order by j.journal_title) AS journal_title, COUNT(j.journal_title) as number\n",
    "      from (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "      FROM author \n",
    "      ORDER BY rank_total_pubs \n",
    "      LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "      INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "      INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "      INNER JOIN journal j ON ar.journal_issn = j.journal_issn\n",
    "      group by a.author_id, rank, publications,j.journal_title\n",
    "      having j.journal_title = mode() within group (order by j.journal_title)) as final1 ON \n",
    "    final.author_id = final1.author_id AND final.number < final1.number\n",
    "WHERE final1.author_id IS NULL\n",
    "ORDER BY final.rank \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "adcc9f9f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>publications</th>\n",
       "        <th>top_journal</th>\n",
       "        <th>percentage_of_all_publications</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "        <td>IEEE Transactions on Image Processing</td>\n",
       "        <td>3%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "        <td>Journal of Computational Physics</td>\n",
       "        <td>3%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "        <td>IEEE Signal Processing Letters</td>\n",
       "        <td>1%</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 163, 'IEEE Transactions on Image Processing', '3%'),\n",
       " ('WangY', 1, 163, 'Journal of Computational Physics', '3%'),\n",
       " ('WangX', 2, 158, 'IEEE Signal Processing Letters', '1%')]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_two"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de64f75d",
   "metadata": {},
   "source": [
    "### What was the most productive year (N publications) for top 0.01% scientists?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "e0724a9d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "3 rows affected.\n",
      "Returning data to local variable query_three\n"
     ]
    }
   ],
   "source": [
    "%%sql query_three <<\n",
    "\n",
    "SELECT final.author_id, final.rank, final.year AS most_influential_year, final.pub AS count_of_pub, final.avg_cites\n",
    "FROM (SELECT a.author_id, rank, count(ar.year) as pub, ar.year, (sum(ar.n_cites::DECIMAL)::int) / count(ar.year) as avg_cites\n",
    "    FROM (SELECT author_id, rank_total_pubs as rank\n",
    "    FROM author\n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, ar.year) as final\n",
    "LEFT JOIN (SELECT a.author_id, rank, count(ar.year) as pub, ar.year, (sum(ar.n_cites::DECIMAL)::int) / count(ar.year) as avg_cites\n",
    "    FROM (SELECT author_id, rank_total_pubs as rank\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, ar.year) as final1 ON \n",
    "    final.author_id = final1.author_id AND final.avg_cites < final1.avg_cites\n",
    "WHERE final1.author_id IS NULL\n",
    "ORDER BY final.rank \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "dbe83b73",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>most_influential_year</th>\n",
       "        <th>count_of_pub</th>\n",
       "        <th>avg_cites</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>2018</td>\n",
       "        <td>7</td>\n",
       "        <td>250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>2017</td>\n",
       "        <td>4</td>\n",
       "        <td>85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>2016</td>\n",
       "        <td>7</td>\n",
       "        <td>229</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 2018, 7, 250),\n",
       " ('WangX', 2, 2017, 4, 85),\n",
       " ('ZhangJ', 3, 2016, 7, 229)]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_three"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14149fa7",
   "metadata": {},
   "source": [
    "### What was the most influential (in terms of N citations/ N publications) year for top 3% scientists?\n",
    "Outcome: list of (a) top 3% scientists, most influential year, count of publications for that year, average N of citations per publication."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "8b10b5cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "3 rows affected.\n",
      "Returning data to local variable query_four\n"
     ]
    }
   ],
   "source": [
    "%%sql query_four <<\n",
    "\n",
    "SELECT final.author_id, final.rank, final.publications, final.most_productive_year, final.count_of_pub\n",
    "FROM (SELECT a.author_id, rank, publications, ar.year AS most_productive_year, count(ar.year) as count_of_pub\n",
    "    FROM (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, publications, ar.year) as final\n",
    "LEFT JOIN (SELECT a.author_id, rank, publications, ar.year AS most_productive_year, count(ar.year) as count_of_pub\n",
    "    FROM (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, publications, ar.year) as final1 ON \n",
    "    final.author_id = final1.author_id AND final.count_of_pub < final1.count_of_pub\n",
    "WHERE final1.author_id IS NULL\n",
    "ORDER BY final.rank \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "9718b6fd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>publications</th>\n",
       "        <th>most_productive_year</th>\n",
       "        <th>count_of_pub</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "        <td>2022</td>\n",
       "        <td>25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "        <td>2022</td>\n",
       "        <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>154</td>\n",
       "        <td>2022</td>\n",
       "        <td>30</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 163, 2022, 25),\n",
       " ('WangX', 2, 158, 2022, 20),\n",
       " ('ZhangJ', 3, 154, 2022, 30)]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_four"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3426a65e",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 5.2. Graph Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d362a4d8",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn_neo = Neo4jConnection(uri='bolt://neo:7687', user='', pwd='')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b3c63cad-9474-4e57-b95d-19b65902871e",
   "metadata": {},
   "source": [
    "### Number of articles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1867677b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15240\n"
     ]
    }
   ],
   "source": [
    "result = conn_neo.query('MATCH (n:Article) RETURN COUNT(n) AS ct')\n",
    "print(result[0]['ct'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "281b1638-f54c-4c0d-8ba5-00669d68643c",
   "metadata": {},
   "source": [
    "### Number of authors"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "92de8dff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "29070\n"
     ]
    }
   ],
   "source": [
    "result = conn_neo.query('MATCH (n:Author) RETURN COUNT(n) AS ct')\n",
    "print(result[0]['ct'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "b742daeb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warm-up query result: [<Record count(n.prop) + count(r.prop)=0>]\n",
      "15240\n",
      "29070\n",
      "1600\n",
      "135\n",
      "[<Record count(r)=0>]\n"
     ]
    }
   ],
   "source": [
    "result_warmup1 = conn_neo.query(\"\"\"\n",
    "        MATCH (n)\n",
    "        OPTIONAL MATCH (n)-[r]->()\n",
    "        RETURN count(n.prop) + count(r.prop)\n",
    "        \"\"\")\n",
    "print(f'Warm-up query result: {result_warmup1}')\n",
    "\n",
    "\n",
    "result_warmup2 = conn_neo.query('MATCH (n:Article) RETURN COUNT(n) AS ct')\n",
    "print(result_warmup2[0]['ct'])\n",
    "\n",
    "result_warmup3 = conn_neo.query('MATCH (n:Author) RETURN COUNT(n) AS ct')\n",
    "print(result_warmup3[0]['ct'])\n",
    "\n",
    "result_warmup4 = conn_neo.query('MATCH (n:Journal) RETURN COUNT(n) AS ct')\n",
    "print(result_warmup4[0]['ct'])\n",
    "\n",
    "result_warmup5 = conn_neo.query('MATCH (n:Category) RETURN COUNT(n) AS ct')\n",
    "print(result_warmup5[0]['ct'])\n",
    "\n",
    "result_warmup4 = conn_neo.query(\"\"\"\n",
    "        MATCH (n)\n",
    "        OPTIONAL MATCH (n:Author)-[r:AUTHORED]->(n2:Article)\n",
    "        RETURN count(r)\n",
    "        \"\"\")\n",
    "print(result_warmup4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cccf1c67",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Delete\n",
    "# conn_neo.query('MATCH (n) OPTIONAL MATCH (n)-[r]-() DELETE n, r')\n",
    "\n",
    "# Delete a specific node (here: all Author nodes):\n",
    "#conn_neo.query(\"\"\"MATCH (n:Author) DELETE n\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c80c13f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "print('Setting constraints to unique IDs...')\n",
    "            # Add ID uniqueness constraint to optimize queries\n",
    "conn_neo.query('CREATE CONSTRAINT ON(n:Category) ASSERT n.id IS UNIQUE')\n",
    "conn_neo.query('CREATE CONSTRAINT ON(j:Journal) ASSERT j.id IS UNIQUE')\n",
    "conn_neo.query('CREATE CONSTRAINT ON(au:Author) ASSERT au.id IS UNIQUE')\n",
    "conn_neo.query('CREATE CONSTRAINT ON(ar:Article) ASSERT ar.id IS UNIQUE')\n",
    "print('Constraints to unique IDs successfully set!')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "196167a3",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Adding 'category' nodes to Neo4J...\")\n",
    "add_category(conn_neo, category)\n",
    "print(\"'category' added to Neo4J!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7f67ed78",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Adding 'journal' nodes to Neo4J...\")\n",
    "add_journal(conn_neo, journal)\n",
    "print(\"'journal' added to Neo4J!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fa67f33c",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Adding 'article' nodes to Neo4J...\")\n",
    "add_article(conn_neo, article)\n",
    "print(\"'article' added to Neo4J!\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1c1916ad",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Adding 'author' nodes to Neo4J...\")\n",
    "add_author(conn_neo, author)\n",
    "print(\"'author' added to Neo4J!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "8cf8ab07",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding 'article_category' relationship to Neo4J...\n",
      "'article_category' added to Neo4J!\n"
     ]
    }
   ],
   "source": [
    "print(\"Adding 'article_category' relationship to Neo4J...\")\n",
    "add_article_category(conn_neo, article_category)\n",
    "print(\"'article_category' added to Neo4J!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "31c519ae-936f-4260-93c2-0822e716f50f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adding 'authorship' relationship to Neo4J...\n",
      "'authorship' added to Neo4J!\n"
     ]
    }
   ],
   "source": [
    "print(\"Adding 'authorship' relationship to Neo4J...\")\n",
    "add_authorship(conn_neo, authorship)\n",
    "print(\"'authorship' added to Neo4J!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "5932220f-57bd-48ef-bfb7-111189ea5714",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Added co-authorship relations.\n"
     ]
    }
   ],
   "source": [
    "# Add co-authorship\n",
    "conn_neo.query(\"\"\"\n",
    "    MATCH (author1:Author) - [:AUTHORED] -> (article:Article) <-[:AUTHORED] - (author2:Author)\n",
    "    CREATE (author1)-[new:COAUTHORS]->(author2)\n",
    "    RETURN type(new);\n",
    "    \"\"\")\n",
    "print(\"Added co-authorship relations.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4c7bd86f-757b-43e1-8bf8-0b1400d4dec8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "21a8a0fb-4bde-47f8-b374-4539fc9accfb",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57513469-3184-4601-8a62-fba89d743e42",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "19c51c67",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "result = conn_neo.query(\n",
    "\"\"\"\n",
    "MATCH (author:Author)-[:AUTHORED]->(article:Article) \n",
    "WHERE author.id = \"GousiosG\" \n",
    "WITH author, COUNT(article) AS number_of_articles, collect(article) AS articles\n",
    "ORDER BY number_of_articles DESC b\n",
    "UNWIND articles AS article\n",
    "MATCH (coauthor:Author)-[:AUTHORED]->(article)\n",
    "RETURN article, collect(coauthor), COUNT(article), COUNT(coauthor)\n",
    "\"\"\"\n",
    ")\n",
    "#for r in result:\n",
    "#    print(r)\n",
    "display(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d3edddb0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ego-network WITH the author\n",
    "MATCH (author:Author)-[:AUTHORED]->(article:Article) \n",
    "WHERE author.id = \"BirkedalL\" \n",
    "WITH author, COUNT(article) AS number_of_articles, collect(article) AS articles\n",
    "ORDER BY number_of_articles DESC \n",
    "UNWIND articles AS article\n",
    "MATCH (coauthor:Author)-[:AUTHORED]->(article)\n",
    "RETURN article, collect(coauthor), COUNT(article), COUNT(coauthor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2ca9deb7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ego-network WITHOUT the author\n",
    "# https://stackoverflow.com/questions/28816222/finding-a-list-of-neo4j-nodes-which-have-the-most-relationships-back-to-another\n",
    "MATCH (author:Author)-[:AUTHORED]->(article:Article) \n",
    "WHERE author.id = \"BirkedalL\" \n",
    "WITH author, COUNT(article) AS number_of_articles, collect(article) AS articles\n",
    "ORDER BY number_of_articles DESC \n",
    "UNWIND articles AS article\n",
    "MATCH (coauthor:Author)-[:AUTHORED]->(article)\n",
    "WHERE coauthor <> author\n",
    "RETURN article, collect(coauthor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2efc87c6",
   "metadata": {},
   "outputs": [],
   "source": [
    "article[article['article_id'].isnull()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4959629c",
   "metadata": {},
   "outputs": [],
   "source": [
    "article[article['doi'].isnull()]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  },
  "vscode": {
   "interpreter": {
    "hash": "b0fa6594d8f4cbf19f97940f81e996739fb7646882a419484c72d19e05852a7e"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
