{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c2f83ced",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Data Engineering Project \n",
    "## ETL\n",
    "\n",
    "**Authors**: \n",
    "- Dmitri Rozgonjuk\n",
    "- Eerik Sven Puudist\n",
    "- Lisanne Siniväli\n",
    "- Cheng-Han Chung\n",
    "\n",
    "\n",
    "The aim of this script is to clean the main raw data frame and write a new, clean data frame for further use. In this notebook, the comparisons of different read- and write-methods are demonstrated."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0a2f864d",
   "metadata": {},
   "source": [
    "First, we install and import the necessary libraries from one cell (to avoid having libraries in some individual cells below). The packages and their versions to be installed will later be added to the `requirements.txt` file.\n",
    "\n",
    "We also use this section to set global environment parameters."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "026c8b65",
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install -r requirements.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "f3aea754",
   "metadata": {},
   "outputs": [],
   "source": [
    "################### Imports ####################\n",
    "### Data wrangling\n",
    "import pandas as pd # working with dataframes\n",
    "\n",
    "### Database drivers\n",
    "import psycopg2\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Custom scripts \n",
    "## Neo4J\n",
    "import sys\n",
    "sys.path.append('./dags')\n",
    "from scripts.neo4j_queries import *\n",
    "\n",
    "# MISC\n",
    "import warnings\n",
    "\n",
    "########## SETTING ENV PARAMETERS ################\n",
    "warnings.filterwarnings('ignore') # suppress warnings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ec2508d6",
   "metadata": {},
   "outputs": [],
   "source": [
    "find_tables_or_ingest_raw()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bc5eb752",
   "metadata": {},
   "source": [
    "### Author update and augments\n",
    "In order to query 'gender' of a given author, we first extract all valid (length > 3) first names. We acknowledge that there may be first names that are smaller than four characters in length, but given that query amount is limited, we are going with a more robust way to extract as many names as possible."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ac0f8345",
   "metadata": {},
   "source": [
    "### Journal\n",
    "In order to get the journal information, we need the journal ISSN list from the `article` table. Although journal Impact Factor are more common metrics, they are trademarked and, hence, retrieving them is not open-source. The alternative is to use SNIP - source-normalized impact per publication. This is the average number of citations per publication, corrected for differences in citation practice between research domains. Fortunately, the list of journals and their SNIP is available from the CWTS website (https://www.journalindicators.com/)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "828e14af",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1f1e4a54",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "674d6fd5",
   "metadata": {},
   "source": [
    "# 5. Example Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "96e48bfc",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 5.1. Data Warehouse"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "016be99c-57bc-4779-8382-bc2ba6da0612",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "%reload_ext sql\n",
    "%sql postgresql://airflow:airflow@postgres/airflow"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "30fc7712",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>50902</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[(50902,)]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql SELECT COUNT(*) FROM author;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "b1c41be3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>article_id</th>\n",
       "        <th>title</th>\n",
       "        <th>doi</th>\n",
       "        <th>n_authors</th>\n",
       "        <th>journal_issn</th>\n",
       "        <th>type</th>\n",
       "        <th>n_cites</th>\n",
       "        <th>year</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>704.0046</td>\n",
       "        <td>A limit relation for entropy and channel capacity per unit cost</td>\n",
       "        <td>10.1063/1.2779138</td>\n",
       "        <td>3</td>\n",
       "        <td>0022-2488</td>\n",
       "        <td>journal-article</td>\n",
       "        <td>6.0</td>\n",
       "        <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>704.0098</td>\n",
       "        <td>Sparsely-spread CDMA - a statistical mechanics based analysis</td>\n",
       "        <td>10.1088/1751-8113/40/41/004</td>\n",
       "        <td>2</td>\n",
       "        <td>1751-8113</td>\n",
       "        <td>journal-article</td>\n",
       "        <td>26.0</td>\n",
       "        <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>704.0217</td>\n",
       "        <td>Capacity of a Multiple-Antenna Fading Channel with a Quantized Precoding<br>  Matrix</td>\n",
       "        <td>10.1109/TIT.2008.2011437</td>\n",
       "        <td>2</td>\n",
       "        <td>0018-9448</td>\n",
       "        <td>journal-article</td>\n",
       "        <td>113.0</td>\n",
       "        <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>704.0301</td>\n",
       "        <td>Differential Recursion and Differentially Algebraic Functions</td>\n",
       "        <td>10.1145/1507244.1507252</td>\n",
       "        <td>1</td>\n",
       "        <td>1529-3785</td>\n",
       "        <td>journal-article</td>\n",
       "        <td>4.0</td>\n",
       "        <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>704.0954</td>\n",
       "        <td>Sensor Networks with Random Links: Topology Design for Distributed<br>  Consensus</td>\n",
       "        <td>10.1109/TSP.2008.920143</td>\n",
       "        <td>2</td>\n",
       "        <td>1053-587X</td>\n",
       "        <td>journal-article</td>\n",
       "        <td>186.0</td>\n",
       "        <td>2009</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('704.0046', 'A limit relation for entropy and channel capacity per unit cost', '10.1063/1.2779138', 3, '0022-2488', 'journal-article', '6.0', 2009),\n",
       " ('704.0098', 'Sparsely-spread CDMA - a statistical mechanics based analysis', '10.1088/1751-8113/40/41/004', 2, '1751-8113', 'journal-article', '26.0', 2009),\n",
       " ('704.0217', 'Capacity of a Multiple-Antenna Fading Channel with a Quantized Precoding\\n  Matrix', '10.1109/TIT.2008.2011437', 2, '0018-9448', 'journal-article', '113.0', 2010),\n",
       " ('704.0301', 'Differential Recursion and Differentially Algebraic Functions', '10.1145/1507244.1507252', 1, '1529-3785', 'journal-article', '4.0', 2009),\n",
       " ('704.0954', 'Sensor Networks with Random Links: Topology Design for Distributed\\n  Consensus', '10.1109/TSP.2008.920143', 2, '1053-587X', 'journal-article', '186.0', 2009)]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql SELECT * FROM article LIMIT 5;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e8ca0e6d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>article_id</th>\n",
       "        <th>category_id</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1001.0001</td>\n",
       "        <td>cs.IT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1001.0001</td>\n",
       "        <td>math.IT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1001.0361</td>\n",
       "        <td>cs.CY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1001.0361</td>\n",
       "        <td>cs.DL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1001.1065</td>\n",
       "        <td>math.CO</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('1001.0001', 'cs.IT'),\n",
       " ('1001.0001', 'math.IT'),\n",
       " ('1001.0361', 'cs.CY'),\n",
       " ('1001.0361', 'cs.DL'),\n",
       " ('1001.1065', 'math.CO')]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql SELECT * FROM article_category LIMIT 5;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d6e52ba1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>category_id</th>\n",
       "        <th>superdom</th>\n",
       "        <th>subdom</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>adap-org</td>\n",
       "        <td>adap-org</td>\n",
       "        <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>astro-ph</td>\n",
       "        <td>astro-ph</td>\n",
       "        <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>astro-ph.CO</td>\n",
       "        <td>astro-ph</td>\n",
       "        <td>CO</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>astro-ph.EP</td>\n",
       "        <td>astro-ph</td>\n",
       "        <td>EP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>astro-ph.GA</td>\n",
       "        <td>astro-ph</td>\n",
       "        <td>GA</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('adap-org', 'adap-org', 'NaN'),\n",
       " ('astro-ph', 'astro-ph', 'NaN'),\n",
       " ('astro-ph.CO', 'astro-ph', 'CO'),\n",
       " ('astro-ph.EP', 'astro-ph', 'EP'),\n",
       " ('astro-ph.GA', 'astro-ph', 'GA')]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql SELECT * FROM category LIMIT 10;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5d0a96ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>journal_issn</th>\n",
       "        <th>journal_title</th>\n",
       "        <th>snip_latest</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>0001-0782</td>\n",
       "        <td>Communications of the ACM</td>\n",
       "        <td>3.01414130932734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>0001-1452</td>\n",
       "        <td>AIAA Journal</td>\n",
       "        <td>1.30854658287369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>0001-1541</td>\n",
       "        <td>AICHE Journal</td>\n",
       "        <td>1.1617454216392</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>0001-4346</td>\n",
       "        <td>Mathematical Notes</td>\n",
       "        <td>0.863770630588359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>0001-4575</td>\n",
       "        <td>Accident Analysis and Prevention</td>\n",
       "        <td>2.30067698862861</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('0001-0782', 'Communications of the ACM', 3.01414130932734),\n",
       " ('0001-1452', 'AIAA Journal', 1.30854658287369),\n",
       " ('0001-1541', 'AICHE Journal', 1.1617454216392),\n",
       " ('0001-4346', 'Mathematical Notes', 0.863770630588359),\n",
       " ('0001-4575', 'Accident Analysis and Prevention', 2.30067698862861)]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql SELECT * FROM journal LIMIT 10;"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0c714fda",
   "metadata": {},
   "source": [
    "### Who are the top 0.01% scientists with the most publications in the sample?\n",
    "Outcome: list of 0.01% top scientists, count of publications, ranking in terms of the total sample."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3186551c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n",
      "Returning data to local variable query_one\n"
     ]
    }
   ],
   "source": [
    "%%sql query_one <<\n",
    "SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "FROM author \n",
    "ORDER BY rank_total_pubs \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76451301",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>publications</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>154</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>LiuY</td>\n",
       "        <td>4</td>\n",
       "        <td>144</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangY</td>\n",
       "        <td>5</td>\n",
       "        <td>125</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 163),\n",
       " ('WangX', 2, 158),\n",
       " ('ZhangJ', 3, 154),\n",
       " ('LiuY', 4, 144),\n",
       " ('ZhangY', 5, 125)]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_one"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "87e7d4a4",
   "metadata": {},
   "source": [
    "### Proportionally, in which journals have the top 0.01% of scientists (in terms of publication count) published their work the most?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57d4cd28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n",
      "Returning data to local variable query_two\n"
     ]
    }
   ],
   "source": [
    "%%sql query_two <<\n",
    "SELECT final.author_id, final.rank, final.publications, final.journal_title as top_journal,  TO_CHAR((final.number * 100 / final.publications), 'fm99%') as percentage_of_all_publications\n",
    "FROM (select a.author_id, rank, publications, mode() within group (order by j.journal_title) AS journal_title, COUNT(j.journal_title) as number\n",
    "      from (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "      FROM author \n",
    "      ORDER BY rank_total_pubs \n",
    "      LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "      INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "      INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "      INNER JOIN journal j ON ar.journal_issn = j.journal_issn\n",
    "      group by a.author_id, rank, publications,j.journal_title\n",
    "      having j.journal_title = mode() within group (order by j.journal_title)) as final\n",
    "LEFT JOIN (select a.author_id, rank, publications, mode() within group (order by j.journal_title) AS journal_title, COUNT(j.journal_title) as number\n",
    "      from (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "      FROM author \n",
    "      ORDER BY rank_total_pubs \n",
    "      LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "      INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "      INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "      INNER JOIN journal j ON ar.journal_issn = j.journal_issn\n",
    "      group by a.author_id, rank, publications,j.journal_title\n",
    "      having j.journal_title = mode() within group (order by j.journal_title)) as final1 ON \n",
    "    final.author_id = final1.author_id AND final.number < final1.number\n",
    "WHERE final1.author_id IS NULL\n",
    "ORDER BY final.rank \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "239b47f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>publications</th>\n",
       "        <th>top_journal</th>\n",
       "        <th>percentage_of_all_publications</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "        <td>IEEE Transactions on Image Processing</td>\n",
       "        <td>7%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "        <td>IEEE Transactions on Signal Processing</td>\n",
       "        <td>9%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>154</td>\n",
       "        <td>IEEE Transactions on Wireless Communications</td>\n",
       "        <td>7%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>LiuY</td>\n",
       "        <td>4</td>\n",
       "        <td>144</td>\n",
       "        <td>IEEE Transactions on Image Processing</td>\n",
       "        <td>8%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>LiuY</td>\n",
       "        <td>4</td>\n",
       "        <td>144</td>\n",
       "        <td>IEEE Transactions on Signal Processing</td>\n",
       "        <td>8%</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 163, 'IEEE Transactions on Image Processing', '7%'),\n",
       " ('WangX', 2, 158, 'IEEE Transactions on Signal Processing', '9%'),\n",
       " ('ZhangJ', 3, 154, 'IEEE Transactions on Wireless Communications', '7%'),\n",
       " ('LiuY', 4, 144, 'IEEE Transactions on Image Processing', '8%'),\n",
       " ('LiuY', 4, 144, 'IEEE Transactions on Signal Processing', '8%')]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_two"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "922a72b8",
   "metadata": {},
   "source": [
    "### What was the most productive year (N publications) for top 0.01% scientists?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2c5248d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n",
      "Returning data to local variable query_three\n"
     ]
    }
   ],
   "source": [
    "%%sql query_three <<\n",
    "\n",
    "SELECT final.author_id, final.rank, final.publications, final.most_productive_year as most_productive_year, final.number as count_of_pub\n",
    "FROM (SELECT a.author_id, rank, publications, mode() within group (order by ar.year) AS most_productive_year, sum(publications) as number\n",
    "    FROM (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, publications, ar.year\n",
    "    having ar.year = mode() within group (order by ar.year)) as final\n",
    "LEFT JOIN (SELECT a.author_id, rank, publications, mode() within group (order by ar.year) AS most_productive_year, sum(publications) as number \n",
    "    FROM (SELECT author_id, rank_total_pubs as rank, total_pubs as publications\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, publications, ar.year\n",
    "    having ar.year = mode() within group (order by ar.year)) as final1 ON \n",
    "    final.author_id = final1.author_id AND final.number < final1.number\n",
    "WHERE final1.author_id IS NULL\n",
    "ORDER BY final.rank \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "89d0c5f3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>publications</th>\n",
       "        <th>most_productive_year</th>\n",
       "        <th>count_of_pub</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>163</td>\n",
       "        <td>2021</td>\n",
       "        <td>6683</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "        <td>2020</td>\n",
       "        <td>3792</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "        <td>2021</td>\n",
       "        <td>3792</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>158</td>\n",
       "        <td>2022</td>\n",
       "        <td>3792</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>154</td>\n",
       "        <td>2021</td>\n",
       "        <td>5236</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, 163, 2021, 6683),\n",
       " ('WangX', 2, 158, 2020, 3792),\n",
       " ('WangX', 2, 158, 2021, 3792),\n",
       " ('WangX', 2, 158, 2022, 3792),\n",
       " ('ZhangJ', 3, 154, 2021, 5236)]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_three"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c84f8f06",
   "metadata": {},
   "source": [
    "### What was the most influential (in terms of N citations/ N publications) year for top 3% scientists?\n",
    "Outcome: list of (a) top 3% scientists, most influential year, count of publications for that year, average N of citations per publication."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "005fcd62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " * postgresql://airflow:***@postgres/airflow\n",
      "5 rows affected.\n",
      "Returning data to local variable query_four\n"
     ]
    }
   ],
   "source": [
    "%%sql query_four <<\n",
    "\n",
    "SELECT final.author_id, final.rank, final.hindex, final.pub, final.avg_cites, final.year\n",
    "FROM (SELECT a.author_id, rank, sum(hindex::DECIMAL) as hindex, sum(publications::DECIMAL) as pub, sum(avg_cites::DECIMAL) as avg_cites, ar.year\n",
    "    FROM (SELECT author_id, rank_total_pubs as rank, total_pubs as publications, hindex, avg_cites\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, ar.year) as final\n",
    "LEFT JOIN (SELECT a.author_id, rank, sum(hindex::DECIMAL) as hindex, sum(publications::DECIMAL) as pub, sum(avg_cites::DECIMAL) as avg_cites, ar.year \n",
    "    FROM (SELECT author_id, rank_total_pubs as rank, total_pubs as publications, hindex, avg_cites\n",
    "    FROM author \n",
    "    ORDER BY rank_total_pubs \n",
    "    LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100) AS a\n",
    "    INNER JOIN authorship au ON a.author_id = au.author_id\n",
    "    INNER JOIN article ar ON au.article_id = ar.article_id\n",
    "    GROUP BY a.author_id, rank, ar.year) as final1 ON \n",
    "    final.author_id = final1.author_id AND final.hindex < final1.hindex\n",
    "WHERE final1.author_id IS NULL\n",
    "ORDER BY final.rank \n",
    "LIMIT  0.01 * (SELECT COUNT(*) FROM author) / 100;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e281d542",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author_id</th>\n",
       "        <th>rank</th>\n",
       "        <th>hindex</th>\n",
       "        <th>pub</th>\n",
       "        <th>avg_cites</th>\n",
       "        <th>year</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangY</td>\n",
       "        <td>1</td>\n",
       "        <td>1230</td>\n",
       "        <td>6683</td>\n",
       "        <td>1148.246</td>\n",
       "        <td>2021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>936</td>\n",
       "        <td>3792</td>\n",
       "        <td>1034.424</td>\n",
       "        <td>2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>936</td>\n",
       "        <td>3792</td>\n",
       "        <td>1034.424</td>\n",
       "        <td>2021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>WangX</td>\n",
       "        <td>2</td>\n",
       "        <td>936</td>\n",
       "        <td>3792</td>\n",
       "        <td>1034.424</td>\n",
       "        <td>2022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>ZhangJ</td>\n",
       "        <td>3</td>\n",
       "        <td>1258</td>\n",
       "        <td>5236</td>\n",
       "        <td>1423.138</td>\n",
       "        <td>2021</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[('WangY', 1, Decimal('1230'), Decimal('6683'), Decimal('1148.246'), 2021),\n",
       " ('WangX', 2, Decimal('936'), Decimal('3792'), Decimal('1034.424'), 2020),\n",
       " ('WangX', 2, Decimal('936'), Decimal('3792'), Decimal('1034.424'), 2021),\n",
       " ('WangX', 2, Decimal('936'), Decimal('3792'), Decimal('1034.424'), 2022),\n",
       " ('ZhangJ', 3, Decimal('1258'), Decimal('5236'), Decimal('1423.138'), 2021)]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_four"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3e968b8f",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 5.2. Graph Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "33c16309",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn_neo = Neo4jConnection(uri='bolt://neo:7687', user='', pwd='')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "911d43b6-67d7-41aa-8717-36c118eb85ca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "35546\n"
     ]
    }
   ],
   "source": [
    "result = conn_neo.query('MATCH (n:Article) RETURN COUNT(n) AS ct')\n",
    "print(result[0]['ct'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "9ac346df-8d5e-4e36-9812-fa95b3afb670",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "50902\n"
     ]
    }
   ],
   "source": [
    "result = conn_neo.query('MATCH (n:Author) RETURN COUNT(n) AS ct')\n",
    "print(result[0]['ct'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "5ade6436",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record article=<Node id=161592 labels=frozenset({'Article'}) properties={'year': 2022, 'n_cites': 0.0, 'n_authors': 3, 'journal_issn': '0098-5589', 'id': '2204.03366', 'title': 'Impact of Software Engineering Research in Practice: A Patent and Author\\n  Survey Analysis', 'doi': '10.1109/TSE.2022.3208210'}> collect(coauthor)=[<Node id=172646 labels=frozenset({'Author'}) properties={'total_pubs': 5, 'gender': 'M', 'rank_hindex': 9528, 'last_name': 'Gousios', 'rank_total_cites': 29401, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 40837, 'med_coauthors': 3.0, 'total_cites': 7, 'avg_cites': 1.4, 'rank_total_pubs': 3077, 'hindex': 2, 'id': 'GousiosG', 'first_name': 'Georgios'}>, <Node id=187830 labels=frozenset({'Author'}) properties={'total_pubs': 3, 'gender': nan, 'last_name': 'Spinellis', 'rank_hindex': 29311, 'rank_total_cites': 30972, 'n_unique_coauthors': 6, 'middle_name': nan, 'rank_avg_cites': 38851, 'med_coauthors': 3.0, 'total_cites': 6, 'avg_cites': 2.0, 'rank_total_pubs': 7070, 'hindex': 1, 'id': 'SpinellisD', 'first_name': 'Diomidis'}>, <Node id=200512 labels=frozenset({'Author'}) properties={'total_pubs': 3, 'gender': nan, 'last_name': 'Kotti', 'rank_hindex': 29311, 'rank_total_cites': 30972, 'n_unique_coauthors': 6, 'middle_name': nan, 'rank_avg_cites': 38851, 'med_coauthors': 3.0, 'total_cites': 6, 'avg_cites': 2.0, 'rank_total_pubs': 7070, 'hindex': 1, 'id': 'KottiZ', 'first_name': 'Zoe'}>] COUNT(article)=3 COUNT(coauthor)=3>,\n",
       " <Record article=<Node id=159780 labels=frozenset({'Article'}) properties={'year': 2021, 'n_cites': 5.0, 'n_authors': 2, 'journal_issn': '0164-1212', 'id': '2109.11921', 'title': 'Can We Trust Tests To Automate Dependency Updates? A Case Study of Java\\n  Projects', 'doi': '10.1016/j.jss.2021.111097'}> collect(coauthor)=[<Node id=172646 labels=frozenset({'Author'}) properties={'total_pubs': 5, 'gender': 'M', 'rank_hindex': 9528, 'last_name': 'Gousios', 'rank_total_cites': 29401, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 40837, 'med_coauthors': 3.0, 'total_cites': 7, 'avg_cites': 1.4, 'rank_total_pubs': 3077, 'hindex': 2, 'id': 'GousiosG', 'first_name': 'Georgios'}>, <Node id=205405 labels=frozenset({'Author'}) properties={'total_pubs': 2, 'gender': 'M', 'rank_hindex': 29311, 'last_name': 'Hejderup', 'rank_total_cites': 32716, 'n_unique_coauthors': 3, 'middle_name': nan, 'rank_avg_cites': 37039, 'med_coauthors': 2.0, 'total_cites': 5, 'avg_cites': 2.5, 'rank_total_pubs': 12987, 'hindex': 1, 'id': 'HejderupJ', 'first_name': 'Joseph'}>] COUNT(article)=2 COUNT(coauthor)=2>,\n",
       " <Record article=<Node id=156518 labels=frozenset({'Article'}) properties={'year': 2022, 'n_cites': 0.0, 'n_authors': 4, 'journal_issn': '1382-3256', 'id': '2101.09563', 'title': 'Pr\\\\\"azi: From Package-based to Call-based Dependency Networks', 'doi': '10.1007/s10664-021-10071-9'}> collect(coauthor)=[<Node id=205405 labels=frozenset({'Author'}) properties={'total_pubs': 2, 'gender': 'M', 'rank_hindex': 29311, 'last_name': 'Hejderup', 'rank_total_cites': 32716, 'n_unique_coauthors': 3, 'middle_name': nan, 'rank_avg_cites': 37039, 'med_coauthors': 2.0, 'total_cites': 5, 'avg_cites': 2.5, 'rank_total_pubs': 12987, 'hindex': 1, 'id': 'HejderupJ', 'first_name': 'Joseph'}>, <Node id=172646 labels=frozenset({'Author'}) properties={'total_pubs': 5, 'gender': 'M', 'rank_hindex': 9528, 'last_name': 'Gousios', 'rank_total_cites': 29401, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 40837, 'med_coauthors': 3.0, 'total_cites': 7, 'avg_cites': 1.4, 'rank_total_pubs': 3077, 'hindex': 2, 'id': 'GousiosG', 'first_name': 'Georgios'}>, <Node id=209984 labels=frozenset({'Author'}) properties={'total_pubs': 1, 'gender': 'M', 'rank_hindex': 48170, 'last_name': 'Beller', 'rank_total_cites': 48170, 'n_unique_coauthors': 3, 'middle_name': nan, 'rank_avg_cites': 48170, 'med_coauthors': 3.0, 'total_cites': 0, 'avg_cites': 0.0, 'rank_total_pubs': 34037, 'hindex': 0, 'id': 'BellerM', 'first_name': 'Moritz'}>, <Node id=212964 labels=frozenset({'Author'}) properties={'total_pubs': 1, 'gender': 'M', 'rank_hindex': 48170, 'last_name': 'Triantafyllou', 'rank_total_cites': 48170, 'n_unique_coauthors': 3, 'middle_name': nan, 'rank_avg_cites': 48170, 'med_coauthors': 3.0, 'total_cites': 0, 'avg_cites': 0.0, 'rank_total_pubs': 34037, 'hindex': 0, 'id': 'TriantafyllouK', 'first_name': 'Konstantinos'}>] COUNT(article)=4 COUNT(coauthor)=4>,\n",
       " <Record article=<Node id=156429 labels=frozenset({'Article'}) properties={'year': 2022, 'n_cites': 0.0, 'n_authors': 5, 'journal_issn': '1049-331X', 'id': '2101.06542', 'title': 'ConE: A Concurrent Edit Detection Tool for Large Scale Software\\n  Development', 'doi': '10.1145/3478019'}> collect(coauthor)=[<Node id=196278 labels=frozenset({'Author'}) properties={'total_pubs': 2, 'gender': 'M', 'rank_hindex': 29311, 'last_name': 'Bird', 'rank_total_cites': 18989, 'n_unique_coauthors': 10, 'middle_name': nan, 'rank_avg_cites': 22097, 'med_coauthors': 6.0, 'total_cites': 19, 'avg_cites': 9.5, 'rank_total_pubs': 12987, 'hindex': 1, 'id': 'BirdC', 'first_name': 'Christian'}>, <Node id=172646 labels=frozenset({'Author'}) properties={'total_pubs': 5, 'gender': 'M', 'rank_hindex': 9528, 'last_name': 'Gousios', 'rank_total_cites': 29401, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 40837, 'med_coauthors': 3.0, 'total_cites': 7, 'avg_cites': 1.4, 'rank_total_pubs': 3077, 'hindex': 2, 'id': 'GousiosG', 'first_name': 'Georgios'}>, <Node id=175641 labels=frozenset({'Author'}) properties={'total_pubs': 4, 'gender': nan, 'last_name': 'vanDeursen', 'rank_hindex': 9528, 'rank_total_cites': 22137, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 33858, 'med_coauthors': 4.0, 'total_cites': 14, 'avg_cites': 3.5, 'rank_total_pubs': 4454, 'hindex': 2, 'id': 'vanDeursenA', 'first_name': 'Arie'}>, <Node id=172517 labels=frozenset({'Author'}) properties={'total_pubs': 3, 'gender': 'male', 'rank_hindex': 9528, 'last_name': 'Nagappan', 'rank_total_cites': 18013, 'n_unique_coauthors': 12, 'middle_name': nan, 'rank_avg_cites': 25985, 'med_coauthors': 5.0, 'total_cites': 21, 'avg_cites': 7.0, 'rank_total_pubs': 7070, 'hindex': 2, 'id': 'NagappanN', 'first_name': 'Nachiappan'}>, <Node id=170885 labels=frozenset({'Author'}) properties={'total_pubs': 3, 'gender': 'F', 'rank_hindex': 9528, 'last_name': 'Maddila', 'rank_total_cites': 18013, 'n_unique_coauthors': 12, 'middle_name': nan, 'rank_avg_cites': 25985, 'med_coauthors': 5.0, 'total_cites': 21, 'avg_cites': 7.0, 'rank_total_pubs': 7070, 'hindex': 2, 'id': 'MaddilaC', 'first_name': 'Chandra'}>] COUNT(article)=5 COUNT(coauthor)=5>,\n",
       " <Record article=<Node id=155739 labels=frozenset({'Article'}) properties={'year': 2022, 'n_cites': 2.0, 'n_authors': 6, 'journal_issn': '1049-331X', 'id': '2011.12468', 'title': 'Nudge: Accelerating Overdue Pull Requests Towards Completion', 'doi': '10.1145/3544791'}> collect(coauthor)=[<Node id=195283 labels=frozenset({'Author'}) properties={'total_pubs': 2, 'gender': 'M', 'rank_hindex': 29311, 'last_name': 'Bansal', 'rank_total_cites': 37202, 'n_unique_coauthors': 7, 'middle_name': nan, 'rank_avg_cites': 40655, 'med_coauthors': 3.5, 'total_cites': 3, 'avg_cites': 1.5, 'rank_total_pubs': 12987, 'hindex': 1, 'id': 'BansalC', 'first_name': 'Chetan'}>, <Node id=175641 labels=frozenset({'Author'}) properties={'total_pubs': 4, 'gender': nan, 'last_name': 'vanDeursen', 'rank_hindex': 9528, 'rank_total_cites': 22137, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 33858, 'med_coauthors': 4.0, 'total_cites': 14, 'avg_cites': 3.5, 'rank_total_pubs': 4454, 'hindex': 2, 'id': 'vanDeursenA', 'first_name': 'Arie'}>, <Node id=172517 labels=frozenset({'Author'}) properties={'total_pubs': 3, 'gender': 'male', 'rank_hindex': 9528, 'last_name': 'Nagappan', 'rank_total_cites': 18013, 'n_unique_coauthors': 12, 'middle_name': nan, 'rank_avg_cites': 25985, 'med_coauthors': 5.0, 'total_cites': 21, 'avg_cites': 7.0, 'rank_total_pubs': 7070, 'hindex': 2, 'id': 'NagappanN', 'first_name': 'Nachiappan'}>, <Node id=188239 labels=frozenset({'Author'}) properties={'total_pubs': 1, 'gender': nan, 'last_name': 'Upadrasta', 'rank_hindex': 29311, 'rank_total_cites': 39976, 'n_unique_coauthors': 5, 'middle_name': 'Surya', 'rank_avg_cites': 38851, 'med_coauthors': 5.0, 'total_cites': 2, 'avg_cites': 2.0, 'rank_total_pubs': 34037, 'hindex': 1, 'id': 'UpadrastaS', 'first_name': 'Sai'}>, <Node id=170885 labels=frozenset({'Author'}) properties={'total_pubs': 3, 'gender': 'F', 'rank_hindex': 9528, 'last_name': 'Maddila', 'rank_total_cites': 18013, 'n_unique_coauthors': 12, 'middle_name': nan, 'rank_avg_cites': 25985, 'med_coauthors': 5.0, 'total_cites': 21, 'avg_cites': 7.0, 'rank_total_pubs': 7070, 'hindex': 2, 'id': 'MaddilaC', 'first_name': 'Chandra'}>, <Node id=172646 labels=frozenset({'Author'}) properties={'total_pubs': 5, 'gender': 'M', 'rank_hindex': 9528, 'last_name': 'Gousios', 'rank_total_cites': 29401, 'n_unique_coauthors': 11, 'middle_name': nan, 'rank_avg_cites': 40837, 'med_coauthors': 3.0, 'total_cites': 7, 'avg_cites': 1.4, 'rank_total_pubs': 3077, 'hindex': 2, 'id': 'GousiosG', 'first_name': 'Georgios'}>] COUNT(article)=6 COUNT(coauthor)=6>]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "result = conn_neo.query(\n",
    "\"\"\"\n",
    "MATCH (author:Author)-[:AUTHORED]->(article:Article) \n",
    "WHERE author.id = \"GousiosG\" \n",
    "WITH author, COUNT(article) AS number_of_articles, collect(article) AS articles\n",
    "ORDER BY number_of_articles DESC \n",
    "UNWIND articles AS article\n",
    "MATCH (coauthor:Author)-[:AUTHORED]->(article)\n",
    "RETURN article, collect(coauthor), COUNT(article), COUNT(coauthor)\n",
    "\"\"\"\n",
    ")\n",
    "#for r in result:\n",
    "#    print(r)\n",
    "display(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cc030570",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ego-network WITH the author\n",
    "MATCH (author:Author)-[:AUTHORED]->(article:Article) \n",
    "WHERE author.id = \"WangY\" \n",
    "WITH author, COUNT(article) AS number_of_articles, collect(article) AS articles\n",
    "ORDER BY number_of_articles DESC \n",
    "UNWIND articles AS article\n",
    "MATCH (coauthor:Author)-[:AUTHORED]->(article)\n",
    "RETURN article, collect(coauthor), COUNT(article), COUNT(coauthor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "98bdf4c4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ego-network WITHOUT the author\n",
    "# https://stackoverflow.com/questions/28816222/finding-a-list-of-neo4j-nodes-which-have-the-most-relationships-back-to-another\n",
    "MATCH (author:Author)-[:AUTHORED]->(article:Article) \n",
    "WHERE author.id = \"WangY\" \n",
    "WITH author, COUNT(article) AS number_of_articles, collect(article) AS articles\n",
    "ORDER BY number_of_articles DESC \n",
    "UNWIND articles AS article\n",
    "MATCH (coauthor:Author)-[:AUTHORED]->(article)\n",
    "WHERE coauthor <> author\n",
    "RETURN article, collect(coauthor)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  },
  "vscode": {
   "interpreter": {
    "hash": "b0fa6594d8f4cbf19f97940f81e996739fb7646882a419484c72d19e05852a7e"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
